Repository: lliurex/docker-change-net
Catalog: translations/va/LC_MESSAGES/docker-change-net.po
Languages: es

source: Invalid BIP CIDR '{cidr}': {error}
es: BIP CIDR invalide '{cidr}': {error}

source: Invalid pool CIDR '{cidr}': {error}
es: Pool CIDR invalid '{cidr}': {error}

source: IP {cidr} is not private (RFC 1918). Use: 10.0.0.0/8, 172.16.0.0/12, or 192.168.0.0/16
es: IP {cidr} no és privada (RFC 1918). Utilitzar: 10.0.0.0/8, 172.16.0.0/12, o 192.168.0.0/16

source: No blacklist conflicts
es: Sense conflictes blacklist

source: Conflicts with blacklist: {test} overlaps {bl}
es: Conflicte amb blacklist: {test} i {bl} se solapen

source: Pool must be a dictionary
es: Pool deu ser un diccionari

source: Pool must contain 'base' and 'size' keys
es: Pool deu contindre claus 'base' i 'size'

source: Size must be between 1 and 32
es: La grandària ha de ser entre 1 i 32

source: Size {size} cannot be less than base mask ({mask})
es: La grandària {size} no pot ser menor que la màscara base ({mask})

source: Invalid size: {error}
es: Mida invàlida: {error}

source: Could not find available IP range in any private range (10/172/192)
es: No puc trobar un rang IP disponible d'entre els rangs privats (10/172/192)

source: Could not generate pool {num}: no available ranges
es: No puc generar pool {num}: no hi ha rangs disponibles

source: Conflict: {net1} and {net2} overlap
es: Conflicte: {net1} and {net2} se solapen

source: No conflicts
es: Sense conflictes

source: Error checking conflicts: {error}
es: Error comprovant conflictes: {error}

source: daemon.json must contain a JSON object
es: daemon.json deu contindre un objecte JSON

source: daemon.json contains invalid JSON: {error}
es: daemon.json conté un JSON invàlid: {error}

source: No permissions to read {path}. Check file permissions
es: Sense permís per a llegir {path}. Comprova els permisos del fitxer

source: Couldn't create backup from daemon.json: {error}
es: No es pot crear una còpia de seguretat de daemon.json: {error}

source: Error writing configuration: {error}
es: Error escrivint la configuració: {error}

source: Root user
es: Usuari root

source: User in docker group
es: Usuari en el grup docker

source: Insufficient permissions
es: Permisos insuficients

source: Could not determine current user
es: No puc determinar l'usuari actual

source: Docker group is primary group
es: El grup primari docker

source: Docker group does not exist
es: El grup docker no existix

source: User not in docker group
es: L'usuari no està en el grup docker

source: Error checking group: {error}
es: Error comprovant el grup: {error}

source: Error restarting Docker: {stderr}
es: Error reiniciant Docker: {stderr}

source: Docker restarted successfully
es: Docker reiniciat correctament

source: Fail restarting Docker
es: Fallada reiniciant Docker

source: Timeout restarting Docker
es: Timeout reiniciando Docker

source: Unexpected error: {e}
es: Error inesperat: {e}

source: Changes Docker network range by modifying daemon.json
es: Canvia el rang de xarxa de Docker modificant daemon.json

source: Usage examples: # Automatic mode (generates random ranges) docker-change-net # Change only default bridge docker-change-net --bip 10.10.0.1/16 # Change only pools (size defaults to 24) docker-change-net --pool-base 10.20.0.0/16 # Change pools with explicit size docker-change-net --pool-base 10.20.0.0/16 --pool-size 24 # Change both docker-change-net --bip 10.10.0.1/16 --pool-base 10.20.0.0/16 --pool-size 24 # Multiple pools (all default to size 24) docker-change-net --pool-base 10.20.0.0/16 --pool-base 10.30.0.0/16 # Multiple pools with mixed explicit/default sizes docker-change-net --pool-base 10.20.0.0/16 --pool-size 24 --pool-base 10.30.0.0/16 # Non-interactive mode docker-change-net --auto -y
es: Exemples d'ús: # Mode automàtic (genera rangs aleatoris) docker-change-net # Canviar només el pont principal docker-change-net --bip 10.10.0.1/16 # Canviar només els pools (size per defecte és 24) docker-change-net --pool-base 10.20.0.0/16 # Canviar els pools amb grandària explicite docker-change-net --pool-base 10.20.0.0/16 --pool-size 24 # Canviar els dos docker-change-net --bip 10.10.0.1/16 --pool-base 10.20.0.0/16 --pool-size 24 # Pools múltiples (tots per defecte amb un size de 24) docker-change-net --pool-base 10.20.0.0/16 --pool-base 10.30.0.0/16 # Pools múltiples amb sizes mesclats/per defecte docker-change-net --pool-base 10.20.0.0/16 --pool-size 24 --pool-base 10.30.0.0/16 # Mode no interactiu docker-change-net --auto -y

source: Remove bip and pools from config
es: Eliminar bip i pools de la configuració

source: New CIDR range for default bridge (docker0)
es: Nou rang CIDR per al pont principal (docker0)

source: Base CIDR network range for address pool (e.g., 10.20.0.0/16). This defines the complete IP range available for the pool. Docker will create subnets from this range based on --pool-size. Use with --pool-size (defaults to 24 if not specified). Can be used multiple times for multiple pools.
es: Rang de xarxa CIDR base per al pool de direccions (ex., 10.20.0.0/16). Això definix el rang complet de IPs disponibles per al pool. Docker crearà subxarxes a partir d'este rang basat en --pool-size. Usar amb --pool-size (per defecte 24 si no s'especifica). Pot usar-se múltiples vegades per a múltiples pools.

source: Subnet prefix length for networks created from the pool (1-32). This defines how large each Docker network will be. For example, size 24 creates /24 subnets (254 hosts each). Optional, defaults to 24 if not specified. Must be >= the base network mask.
es: Longitud del prefix de subxarxa per a xarxes creades des del pool (1-32). Això definix què tan gran serà cada xarxa Docker. Per exemple, grandària 24 crea subxarxes /24 (254 hosts cada una). Opcional, per defecte 24 si no s'especifica. Ha de ser >= la màscara de xarxa base.

source: Path to daemon.json (default: {path})
es: Ruta a daemon.json (per defecte: {path})

source: Directory for backups (default: same as daemon.json)
es: Directori per a còpies de seguretat (per defecte: mateix que daemon.json)

source: Do not ask for confirmation
es: No preguntar per confirmació

source: Generate random ranges automatically
es: Generar rangs aleatoris automàticament

source: --pool-size provided but missing --pool-base arguments.
es: --pool-size proporcionat però falten arguments --pool-base.

source: {bases} --pool-base argument(s) but {sizes} --pool-size argument(s). Cannot have more sizes than bases.
es: {bases} com a arguments --pool-base però {sizes} com a arguments --pool-size. No pot haver-hi més sizes que bases.

source: CURRENT CONFIGURATION FOR DOCKER DAEMON:
es: CONFIGURACIÓ ACTUAL PER AL DAEMON DE DOCKER:

source: Default bridge (bip): {bip}
es: Pont per defecte (bip): {bip}

source: Default bridge (bip): Not configured
es: Pont per defecte (bip): No configurat

source: Address pools:
es: Pools de direccions:

source: Address pools: Not configured
es: Pools de direccions: No configurats

source: PROPOSED CHANGES:
es: CANVIS PROPOSATS:

source: Not configured
es: No configurat

source: Default bridge (bip): {current} → {new}
es: Pont per defecte (bip): {current} → {new}

source: Default bridge (bip): {bip} (no changes)
es: Pont per defecte (bip): {bip} (sense canvis)

source: WARNING: Restarting Docker will stop all running containers
es: ADVERTIMENT: Reiniciar Docker detindrà tots els contenidors en execució

source: Apply changes?
es: ¿Aplicar camvis?

source: Please answer
es: Per favor responga

source: Docker Network Configuration Changer
es: Canviador de Configuració de Xarxa de Docker

source: CHANGES APPLIED SUCCESSFULLY
es: CANVIS APLICATS CORRECTAMENT

source: Backup available at: {path}
es: Còpia de seguretat disponible en: {path}

source: To manually restore:
es: Per a restaurar manualment:

source: Elevating privileges (requires docker group membership)...
es: Elevant privilegis (requerix filiació en el grup docker)...

source: Error insufficient permissions
es: Error de permisos insuficients

source: Docker is not installed
es: Docker no està instal·lat

source: Docker installed ({version})
es: Docker instal·lat ({version})

source: Loading blacklist...
es: Carregant blacklist...

source: Blacklist loaded: {count} ranges
es: Blacklist carregada: {count} rangs

source: No blacklist file found, proceeding without restrictions
es: No hi ha fitxer de blacklist, continuant sense restriccions

source: Reading current configuration...
es: Llegint configuració actual...

source: daemon.json found
es: daemon.json trovat

source: daemon.json does not exist, nothing to do
es: daemon.json no existe, res a fer

source: daemon.json does not exist, will create a new one
es: daemon.json no existix, es crearà un nou

source: Searching for first available ranges...
es: Buscant pels primers rangs disponibles...

source: First available ranges found without blacklist conflicts
es: Primers rangs disponibles trobats sense conflictes amb la blacklist

source: Error generating ranges: {error}
es: Error generant rangs: {error}

source: Error: must provide at least --bip or --pool, or use --auto
es: Error: ha de proporcionar almenys --bip o --pool, o usar --auto

source: Error: manually specified range conflicts with blacklist
es: Error: rang especificat manualment té conflictes amb la blacklist

source: Error: validation failed: {error}
es: Error: validació fallida: {error}

source: Same values that current configuration
es: Mateixos valors que la configuració actual

source: No changes to apply
es: No hi ha canvis que aplicar

source: Operation cancelled by user
es: Operació cancel·lada per l'usuari

source: Creating backup...
es: Creant còpia de seguretat...

source: Backup created: {path}
es: Còpia de seguretat creada: {path}

source: Writing new configuration...
es: Escrivint nova configuració...

source: Configuration updated
es: Configuració actualitzada

source: Restarting Docker service...
es: Reiniciant el servici Docker...

source: Attempting to restore previous configuration...
es: Intentant restaurar la configuració anterior...

source: Manual restoration required:
es: Restauració manual requerida:

source: Unexpected error: {error}
es: Error inesperat: {error}
